app/views/owners/new.html.haml

      .field
        = f.association :category, collection: Category.all.order(:name)
      .field
        = f.association :region, collection: Region.all.order(:name)
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC
SELECT "regions".* FROM "regions" ORDER BY "regions"."name" ASC