app/controllers/owners_controller.rb

SELECT "products".* FROM "products" WHERE "products"."name" = 'Premium' LIMIT 1
---
  def new
    # we are setting supplier as main ivar here as it has a :has_one with owner
    if params[:query]
      @product = Product.find_by_name(params[:query])