app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY created_at DESC
SELECT tags.id, tags.name, count(taggings.tag_id) as count FROM "tags" INNER JOIN "taggings" ON "taggings"."tag_id" = "tags"."id" GROUP BY taggings.tag_id, tags.id, tags.name
---
  def index
    if params[:tag]
      @posts = Post.tagged_with(params[:tag])
    else
      @posts = Post.all(:order => "created_at DESC")